{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_96","layers":[{"class_name":"Dense","config":{"units":8,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense191","trainable":true,"batch_input_shape":[null,149],"dtype":"float32"}},{"class_name":"Dense","config":{"units":6,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense192","trainable":true}}]},"keras_version":"tfjs-layers 1.3.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense191/kernel","shape":[149,8],"dtype":"float32"},{"name":"dense_Dense191/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense192/kernel","shape":[8,6],"dtype":"float32"},{"name":"dense_Dense192/bias","shape":[6],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.3.1","convertedBy":null}